src/Enums/ВидыКонтрагентов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ВидыКонтрагентов</Name>
			<Comment>Виды контрагентов</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Покупатель</Name>
					<Comment>Основное взаимодействие с контрагентом - продажа, передача на комиссию, хранение</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Поставщик</Name>
					<Comment>Основное взаимодействие с контрагентом - закупка и принятие на комиссию, хранение</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПодотчетноеЛицо</Name>
					<Comment>Подотчетное лицо компании</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Филиал</Name>
					<Comment>Филиал компании, одна из организаций</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Собственник</Name>
					<Comment>Собственник компании, осуществляющий финансирование</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КонтактноеЛицо</Name>
					<Comment>Контактное лицо</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Прочее</Name>
					<Comment>Прочие контрагенты</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Производитель</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Enums/ФормыСобственности.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ФормыСобственности</Name>
			<Comment>Варианты форм собственности контрагентов</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ЮридическоеЛицо</Name>
					<Comment>Любая форма юридического лица</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИндивидуальныйПредприниматель</Name>
					<Comment>Индивидуальный предприниматель</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЧастноеЛицо</Name>
					<Comment>Частное лицо</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрочаяФормаСобственности</Name>
					<Comment>Прочий вид собственности</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбособленноеПодразделение</Name>
					<Comment>Обособленное подразделение</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Enums/ТипыКонтактнойИнформации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ТипыКонтактнойИнформации</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Адрес</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Телефон</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АдресЭлектроннойПочты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВебСтраница</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Факс</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Другое</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Skype</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/CommonForms/ЗаполнениеРеквизитовКонтрагента/Ext/Form/Module.bsl
&НаСервере

#Область ОписаниеПеременных

Перем ПолученныеКонтрагенты;

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ОбщегоНазначения.ПодсистемаСуществует("ИнтернетПоддержкаПользователей") Тогда
		ТекстИсключения = НСтр("ru='Заполнение реквизитов в данной конфигурации невозможно.'");
		ВызватьИсключение ТекстИсключения;
	КонецЕсли;
	
	СтрокаПоиска = Параметры.СтрокаПоиска;
	Если НЕ ПустаяСтрока(Параметры.Заголовок) Тогда
		Заголовок = Параметры.Заголовок;
	КонецЕсли;
	
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.АдресныйКлассификатор") Тогда

		МодульАдресныйКлассификатор = ОбщегоНазначения.ОбщийМодуль("АдресныйКлассификатор");
		ТаблицаРегионов = МодульАдресныйКлассификатор.КлассификаторСубъектовРФ();
		Элементы.Регион.СписокВыбора.Очистить();
		Для каждого СтрокаТаблицы Из ТаблицаРегионов Цикл
			Элементы.Регион.СписокВыбора.Добавить(
				Формат(СтрокаТаблицы.КодСубъектаРФ, "ЧЦ=2; ЧДЦ=; ЧВН="), 
				СтрокаТаблицы.Наименование + " " + СтрокаТаблицы.Сокращение);
		КонецЦикла;
		Элементы.Регион.СписокВыбора.СортироватьПоПредставлению();
	
	КонецЕсли;
	
	// ived +++
	НеСоздаватьКонтрагента = ПолучитьЗначениеПараметраСтруктуры(Параметры, "НеСоздаватьКонтрагента", Ложь);
	// ived ---
	
	Элементы.Регион.СписокВыбора.Вставить(0, "", НСтр("ru='Все регионы'"));
	Регион = "";
	УправлениеФормой(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если ЗначениеЗаполнено(СтрокаПоиска) Тогда
		ПодключитьОбработчикОжидания("ВыполнитьПоискКонтрагентов", 0.1, Истина);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	
	Регион = Настройки["Регион"];
	Если Элементы.Регион.СписокВыбора.НайтиПоЗначению(Регион) = Неопределено Тогда
		Регион = "";
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура СтрокаПоискаПриИзменении(Элемент)
	
	Если ЭтоИНН(СтрокаПоиска) Тогда
		Адрес = "";
		ВыполнитьПоискКонтрагентов();
	КонецЕсли;
	УправлениеФормой(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура РегионПриИзменении(Элемент)
	
	Если Элементы.Регион.СписокВыбора.НайтиПоЗначению(Регион) = Неопределено Тогда
		Регион = "";
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыКонтрагенты

&НаКлиенте
Процедура КонтрагентыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ВыполнитьВыборКонтрагента();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура НайтиКонтрагентов(Команда)
	
	ВыполнитьПоискКонтрагентов();
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьКонтрагента(Команда)
	
	ВыполнитьВыборКонтрагента();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиентеНаСервереБезКонтекста
Функция ЭтоИНН(СтрокаПоиска)
	
	Результат = ЗначениеЗаполнено(СтрокаПоиска)
		И (СтрДлина(СтрокаПоиска) = 10 ИЛИ СтрДлина(СтрокаПоиска) = 12)
		И СтроковыеФункцииКлиентСервер.ТолькоЦифрыВСтроке(СтрокаПоиска);
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура ВыполнитьПоискКонтрагентов() Экспорт

	ОписаниеОшибки = "";
	НайтиРеквизитыНаСервере(ОписаниеОшибки);
	
	// Обработка ошибок
	Если ЗначениеЗаполнено(ОписаниеОшибки) Тогда
		Если ОписаниеОшибки = "НеУказаныПараметрыАутентификации" Тогда
			ТекстВопроса = НСтр("ru='Для автоматического заполнения реквизитов контрагентов
				|необходимо подключиться к интернет-поддержке пользователей.
				|Подключиться сейчас?'");
			ОписаниеОповещения = Новый ОписаниеОповещения("ПодключитьИнтернетПоддержку", ЭтотОбъект);
			ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
		ИначеЕсли ОписаниеОшибки = "НеУказанПароль" Тогда
			ТекстВопроса = НСтр("ru='Необходимо указать пароль к Интернет-поддержке пользователей
				|и установить флажок ""Запомнить пароль"".
				|Указать сейчас?'");
			ОписаниеОповещения = Новый ОписаниеОповещения("ПодключитьИнтернетПоддержку", ЭтотОбъект);
			ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
		ИначеЕсли ОписаниеОшибки = "Сервис1СКонтрагентНеПодключен" Тогда
			ПараметрыФормы = Новый Структура;
			ПараметрыФормы.Вставить("ИдентификаторМестаВызова", "zapolnenie_rekvizitov");
			ОткрытьФорму("ОбщаяФорма.Сервис1СКонтрагентНеПодключен", ПараметрыФормы, ЭтотОбъект);
		Иначе
			ПоказатьПредупреждение(, ОписаниеОшибки);
		КонецЕсли;
	ИначеЕсли КоличествоНайденных > 20 Тогда
		ТекстПредупреждения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru='Найдено слишком много похожих контрагентов (%1). Уточните реквизиты для поиска.'"),
			КоличествоНайденных);
		ПоказатьПредупреждение(, ТекстПредупреждения);
	ИначеЕсли НЕ ПустаяСтрока(СтрокаПоиска) И КоличествоНайденных = 0 Тогда
		ПоказатьПредупреждение(, НСтр("ru='Ничего не найдено. Уточните реквизиты для поиска.'"));
	КонецЕсли;

КонецПроцедуры 

&НаКлиенте
Процедура ВыполнитьВыборКонтрагента()
	
	ТекДанные = Элементы.Контрагенты.ТекущиеДанные; // ++РАРУС
	Если ТекДанные = Неопределено Тогда
		Если Контрагенты.Количество() = 0 Тогда
			ТекстПредупреждения = НСтр("ru='Ничего не найдено. Уточните реквизиты и нажмите ""Найти"".'");
			ПоказатьПредупреждение(, ТекстПредупреждения);
		КонецЕсли;
		Возврат;
	КонецЕсли;
	
	ТекДанные = ТекДанные.ДанныеЗаполнения;   // ++ РАРУС
	
	Если НЕ ЗначениеЗаполнено(ТекДанные.ИНН) Тогда
		ТекстПредупреждения = НСтр("ru='Выберите контрагента, у которого указан ИНН.'");
		ПоказатьПредупреждение(, ТекстПредупреждения);
		Возврат;
	КонецЕсли;
	
	ПоискПоИНН = ЭтоИНН(СтрокаПоиска);
	
	Если Не ПоискПоИНН Тогда
		СтруктураПараметров = Новый Структура("Наименование, ИНН, КПП, НаименованиеСокращенное, Телефон, ЮридическийАдрес, Руководитель");
		
		ЗаполнитьЗначенияСвойств(СтруктураПараметров, ТекДанные);
		
		// ived +++
		Если НеСоздаватьКонтрагента Тогда
			
			ОповеститьОВыборе(СтруктураПараметров);
			
		Иначе
			
			СоздатьКонтрагента(СтруктураПараметров);
			
		КонецЕсли;
		// ived ---
	Иначе
		ОповеститьОВыборе(ТекДанные.ИНН);
	КонецЕсли;
КонецПроцедуры 

&НаСервере
Процедура СоздатьКонтрагента(СтруктураПараметров)
	// предполагаем что контрагента нет в системе
	Результат = Ложь;
	
	// формируем запрос
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ Ссылка ИЗ Справочник.Контрагенты ГДЕ Наименование = &Наименование ИЛИ ИНН = &ИНН";
	
	// ставим параметры
	Запрос.УстановитьПараметр("Наименование", СтруктураПараметров.Наименование);
	Запрос.УстановитьПараметр("ИНН", СтруктураПараметров.ИНН);
	
	// выполняем
	РезультатЗапроса = Запрос.Выполнить();
	
	// смотрим есть ли данные
	Если Не РезультатЗапроса.Пустой() Тогда
		// взводим признак
		Результат = Истина;
		
		// сообщаем
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = НСтр("ru = 'Пользователь с таким наименованием или ИНН уже существует в системе.'");
		Сообщение.Сообщить();
	КонецЕсли;
	
	// если пользователя нет то создаем
	Если Не Результат Тогда
		НовыйЭлемент = Справочники.Контрагенты.СоздатьЭлемент();
		
		// заполняем параметры
		НовыйЭлемент.Наименование       = СтруктураПараметров.НаименованиеСокращенное;
		НовыйЭлемент.НаименованиеПолное = СтруктураПараметров.Наименование;
		НовыйЭлемент.ИНН                = СтруктураПараметров.ИНН;
		НовыйЭлемент.КПП                = СтруктураПараметров.КПП;
		НовыйЭлемент.ВидКонтрагента     = Перечисления.ВидыКонтрагентов.Прочее;
		
		Если СтрДлина(НовыйЭлемент.ИНН) = 10 Тогда
			НовыйЭлемент.ФормаСобственности = Перечисления.ФормыСобственности.ЮридическоеЛицо;
		Иначе
			НовыйЭлемент.ФормаСобственности = Перечисления.ФормыСобственности.ИндивидуальныйПредприниматель;
		КонецЕсли;
		
		// записываем адрес
		Если ЗначениеЗаполнено(СтруктураПараметров.ЮридическийАдрес) Тогда
			АдресXDTO = УправлениеКонтактнойИнформациейСлужебный.КонтактнаяИнформацияXDTOПоПредставлению(СтруктураПараметров.ЮридическийАдрес, Перечисления.ТипыКонтактнойИнформации.Адрес);
			АдресXML = УправлениеКонтактнойИнформациейСлужебный.КонтактнаяИнформацияXDTOВXML(АдресXDTO);
		
			УправлениеКонтактнойИнформацией.ЗаписатьКонтактнуюИнформацию(НовыйЭлемент, АдресXML, Справочники.ВидыКонтактнойИнформации.ЮрАдресКонтрагента, Перечисления.ТипыКонтактнойИнформации.Адрес,, Неопределено, Истина);
		КонецЕсли;
			
		// записываем телефон
		Если ЗначениеЗаполнено(СтруктураПараметров.Телефон) Тогда
			ТелефонXDTO = УправлениеКонтактнойИнформациейСлужебный.КонтактнаяИнформацияXDTOПоПредставлению(СтруктураПараметров.Телефон, Перечисления.ТипыКонтактнойИнформации.Телефон);
			ТелефонXML = УправлениеКонтактнойИнформациейСлужебный.КонтактнаяИнформацияXDTOВXML(ТелефонXDTO);
		
			УправлениеКонтактнойИнформацией.ЗаписатьКонтактнуюИнформацию(НовыйЭлемент, ТелефонXML, Справочники.ВидыКонтактнойИнформации.ТелефонКонтрагента, Перечисления.ТипыКонтактнойИнформации.Телефон,, Неопределено, Истина);
		КонецЕсли;
			
		// записываем
		Попытка
			НовыйЭлемент.Записать();
			
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = НСтр("ru = 'Контрагент" + Символы.НПП + НовыйЭлемент.Наименование + Символы.НПП + "успешно создан.'");
			Сообщение.Сообщить();
		Исключение
			ЗаписьЖурналаРегистрации(
				НСтр("ru = 'Ошибка при записи элемента справочника ""Контрагенты"".'",
					ОбщегоНазначенияКлиентСервер.КодОсновногоЯзыка()),
				УровеньЖурналаРегистрации.Ошибка,,,ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		КонецПопытки;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура НайтиРеквизитыНаСервере(ОписаниеОшибки)
	
	Если НЕ ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;
	
	Информация = "";
	Контрагенты.Очистить();
	КоличествоНайденных = 0;
			
	ПоискПоИНН = ЭтоИНН(СтрокаПоиска);
	ПоискЮридическогоЛица = (ПоискПоИНН И СтрДлина(СтрокаПоиска) = 10) 
		ИЛИ НЕ ПоискПоИНН;
	Если ПоискПоИНН Тогда
		Если ПоискЮридическогоЛица Тогда
			НайденныеРеквизиты = ДанныеЕдиныхГосРеестров.РеквизитыЮридическогоЛицаПоИНН(СтрокаПоиска);
		Иначе
			НайденныеРеквизиты = ДанныеЕдиныхГосРеестров.РеквизитыПредпринимателяПоИНН(СтрокаПоиска);
		КонецЕсли;
	Иначе
		НайденныеРеквизиты = ДанныеЕдиныхГосРеестров.РеквизитыЮридическихЛицПоНаименованию(СтрокаПоиска, Регион, Адрес);
	КонецЕсли;
	Если ЗначениеЗаполнено(НайденныеРеквизиты.ОписаниеОшибки) Тогда
		ОписаниеОшибки = НайденныеРеквизиты.ОписаниеОшибки;
		Возврат;
	КонецЕсли;
		
	Если ПоискПоИНН Тогда
		НоваяСтрока = Контрагенты.Добавить();
		НоваяСтрока.ИНН = НайденныеРеквизиты.ИНН;
		Если ПоискЮридическогоЛица Тогда
			НоваяСтрока.Наименование = НайденныеРеквизиты.НаименованиеПолное;
			Если НайденныеРеквизиты.ЮридическийАдрес <> Неопределено Тогда
				НоваяСтрока.ЮридическийАдрес = НайденныеРеквизиты.ЮридическийАдрес.Представление;
			КонецЕсли;
			Если НайденныеРеквизиты.Руководитель <> Неопределено Тогда
				НоваяСтрока.Руководитель = НайденныеРеквизиты.Руководитель.Представление;
			КонецЕсли;
		Иначе
			НоваяСтрока.Наименование = НайденныеРеквизиты.Наименование;
		КонецЕсли;
		// ++ РАРУС
		НоваяСтрока.ДанныеЗаполнения = НайденныеРеквизиты;
		// -- РАРУС
		КоличествоНайденных = 1;
	Иначе
		Для каждого РеквизитыОрганизации Из НайденныеРеквизиты.РеквизитыОрганизаций Цикл
			НоваяСтрока = Контрагенты.Добавить();
			НоваяСтрока.ИНН = РеквизитыОрганизации.ИНН;
			НоваяСтрока.КПП = РеквизитыОрганизации.КПП;
			НоваяСтрока.Наименование = РеквизитыОрганизации.НаименованиеПолное;
			НоваяСтрока.НаименованиеСокращенное = РеквизитыОрганизации.НаименованиеСокращенное;
			// ++РАРУС
			НоваяСтрока.ДанныеЗаполнения = РеквизитыОрганизации;
			// --РАРУС
			
			// заполняем адрес
			Если РеквизитыОрганизации.ЮридическийАдрес <> Неопределено Тогда
				НоваяСтрока.ЮридическийАдрес = РеквизитыОрганизации.ЮридическийАдрес.Представление;
			КонецЕсли;
			
			// заполняем руководителя
			Если РеквизитыОрганизации.Руководитель <> Неопределено Тогда
				НоваяСтрока.Руководитель = РеквизитыОрганизации.Руководитель.Фамилия
				+ " " + РеквизитыОрганизации.Руководитель.Имя
				+ " " + РеквизитыОрганизации.Руководитель.Отчество;
			КонецЕсли;
			
			// заполняем телефон
			Если РеквизитыОрганизации.Телефон <> Неопределено Тогда
				НоваяСтрока.Телефон = РеквизитыОрганизации.Телефон.Представление;
			КонецЕсли;
			
		КонецЦикла;
		КоличествоНайденных = НайденныеРеквизиты.КоличествоНайденных;
	КонецЕсли;
	
	Если КоличествоНайденных > 20 Тогда
		ТекущийЭлемент = Элементы.СтрокаПоиска;
		Информация = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru='Показаны первые 20 контрагентов из %1 найденных. Уточните реквизиты для поиска.'"), 
			КоличествоНайденных);
	ИначеЕсли КоличествоНайденных > 0 Тогда
		ТекущийЭлемент = Элементы.Контрагенты;
		Элементы.Контрагенты.ТекущаяСтрока = Контрагенты[0].ПолучитьИдентификатор();
	Иначе
		ТекущийЭлемент = Элементы.СтрокаПоиска;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПодключитьИнтернетПоддержку(Ответ, ДопПараметры) Экспорт

	Если Ответ = КодВозвратаДиалога.Да 
		И ОбщегоНазначенияКлиент.ПодсистемаСуществует("ИнтернетПоддержкаПользователей") Тогда
		ОписаниеОповещения = Новый ОписаниеОповещения("ПодключитьИнтернетПоддержкуЗавершение", ЭтотОбъект, ДопПараметры);
		МодульИнтернетПоддержкаПользователейКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль(
			"ИнтернетПоддержкаПользователейКлиент");
		МодульИнтернетПоддержкаПользователейКлиент.ПодключитьИнтернетПоддержкуПользователей(ОписаниеОповещения, ЭтотОбъект);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПодключитьИнтернетПоддержкуЗавершение(Результат, ДопПараметры) Экспорт

	Если Результат <> Неопределено Тогда
		ВыполнитьПоискКонтрагентов();
	КонецЕсли;

КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УправлениеФормой(Форма)

	ЭтоИНН = ЭтоИНН(Форма.СтрокаПоиска);
	Форма.Элементы.Регион.Доступность = НЕ ЭтоИНН;
	Форма.Элементы.Адрес.Доступность  = НЕ ЭтоИНН;

КонецПроцедуры

#КонецОбласти

#Область Инициализация

ПолученныеКонтрагенты = Новый Массив;

#КонецОбласти
